@extends('layouts.app')


@section('title')
  درباره ما
@endsection


@section('content')
<div class="max-w-7xl mx-auto rounded border shadow-xl mt-20 mb-10 px-8 py-20 bg-gray-50">
  <section>
    <h2 class="text-gray-800 font-bold text-3xl">تاریخچه</h2>
    <p class="text-gray-700 text-xl my-2 leading-10 text-justify">لوستر آکسین، یکی از بزرگ‌ترین مجموعه‌های تولید محصولات در زمینه لوستر، مبلمان و لوازم تزئینی و لوکس منزل است که از سال ۱۴۰۰ فعالیت خود را آغاز نمود. لوستر آکسین، وبسایت خرید آنلاین لوستر است و بیش از ۱۰۰۰ محصول از بهترین کالاهای ایرانی را برای مشتریان فراهم آورده است. و با خدمات پیش و پس از فروشی از جمله پرداخت در محل برای استان تهران، ارسال رایگان به تمام نقاط کشور برای خریدهای بالاتر از ۱۵۰ هزار تومان، گارانتی ۱ ساله برای تمام محصولات و ضمانت مرجوعی کالاهای معیوب در راستای جلب رضایت مشتریان تلاش می‌کند.</p>
  </section>

  <section class="my-12">
    <h2 class="text-gray-800 font-bold text-3xl">خدمات مشتریان</h2>
    <p class="text-gray-700 text-xl my-2 leading-10 text-justify">مجموعه لوستر آکسین همواره تلاش کرده است فرآیند خرید را برای مشتریان و مصرف‌کنندگان خود تا حد ممکن ساده‌تر سازد. در همین راستا، کارشناسان لوستر آکسین آماده‌ی مشاوره و راهنمایی در مورد نحوه‌ی انتخاب محصولات هستند؛ آن‌ها به شما کمک می‌کنند با توجه به بودجه، دکوراسیون منزل و سلیقه‌ی خاص خود بهترین گزینه‌ها را انتخاب کنید. پشتیبانی سایت در روزها و ساعات اداری پاسخگوی تمام سوالات مشتریان گرامی است. ارسال محصولات با روش‌های سریع و امن صورت می‌گیرد و در صورت بروز هر گونه مشکل، خدمات تعویض و مرجوعی برای مشتریان در نظر گرفته شده است. همچنین، شما می‌توانید در تمام نقاط ایران برای نصب محصولات خود از لوستر آکسین کمک بگیرید.</p>
  </section>

  <h2 class="text-gray-800 font-bold text-3xl">کالای سفارشی</h2>
  <p class="text-gray-700 text-xl my-2 leading-10 text-justify">از جمله خدمات دیگر لوستر آکسین می‌توان به طراحی و ساخت طرح‌های سفارشی مشتریان اشاره کرد. انواع لوستر و مبلمان در ابعاد و رنگ‌های دلخواه مشتری و متناسب با محیط و چیدمان منزل برای شما طراحی می‌گردد. در طراحی و انتخاب لوستر و مبلمان سفارشی هیچ محدودیتی وجود ندارد.</p>
  <p class="text-gray-700 text-xl my-2 leading-10 text-justify">بازه محصولات آکسین لوستر بسیار گسترده است و شامل انواع لوستر برنزی، لوستر فلزی و دایکاست، لوستر کریستالی، لوستر مدرن، لوستر آویز، لوستر چوبی، لوستر دیواری، لوستر سقفی، میز چوبی، ساعت دیواری، گلدان و مجسمه، شمعدان، هفت سین، صندلی چوبی، ظروف پذیرایی، آباژور رومیزی، آباژور کنار سالنی، مبلمان خانگی و مبلمان تختخواب شو (تخت شو) است.</p>
</div>
@endsection